let handler  = async (m, { conn }) => { 
 let name = conn.getName(m.sender) 
 let teks = ` 
 ${pickRandom([`*🎇 « أذڪـــــــــار المســـــــــاء »🎇*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*1🌇 - (اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ)*
*[سورة البقرة 255]*

*من قالها حين يُمسي أجير من الجن حتى يُصبح ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*2🌇 - (آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ • لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ)*
*[سورة البقرة 285 - 286]*

*من قرأ الآيتين من آخر سورة البقرة في ليلةٍ كفتاه ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*3🌇 - (﷽ قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ) ❸ مرات*

*(﷽ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ) ❸ مرات*

*(﷽ قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَٰهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ) ❸ مرات*

*من قالها حين يصبح وحين يمسي كفته من كل شيء ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*4🌇 - (( أَمسينا وَأَمسي الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ . رَبِّ إنِّي أَسْأَلُكَ خَيْرَ مَا فِي هَذِه الليلة وَخَيْرَ مَا بَعْدَها وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِه الليلة وَشَرِّ مَا بَعْدَها . رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ . رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*5🌇 - (( اللَّهُمَّ أَنْتَ رَبِّي،لاَ إِلَـهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ, أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ ))*

*من قالها مُوقنًا بها حين يُمسي ومات من ليلته دخل الجنة وكذلك حين يُصبح ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*6🌇 - (( رَضِيتُ بِاللهِ رَبًّا, وَبِالإِسْلاَمِ دِينًا, وَبِمُحَمَّدٍ ﷺ نَبِيًّا )) ❸ مرات ..*

*من قالها حين يُصبح وحين يُمسي كان حقًا على الله أن يُرضيَه يوم القيامة ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*7🌇 - (( اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ ، وَحْدَكَ لا شَرِيكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ )) ❹ مرات*

*من قالها أعتقه اللّٰه من النار ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*8🌇 - (( اللهُمَّ مَا أمْسَىَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر ))*

*من قالها حين يُمسي فقد أدَّى شُكر يومه ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*9🌇 - (( حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ )) ❼ مرات*

*من قالها كفاه الله ما أهمه من أمر الدنيا والآخرة ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*10🌇 - (( بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ؛ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*11🌇 - (( اللَّهُمَّ بِكَ أَمسيناَ، وَبِكَ أَصبحنا.، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المصير ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*12🌇 - (( أَمسينا عَلَى فِطْرَةِ الإِسْلاَمِ، وَكَلِمَةِ الإِخْلاَصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُّسْلِمًا -وَمَا كَانَ مِنَ المُشْرِكِين ..* 

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*13🌇 - (( سُبْحَانَ اللهِ وبحمده عَدَدَ خَلْقِهِ, وَرِضَا نَفْسِهِ, وَزِنَةَ عَرْشِهِ, وَمِدَادَ كَلِمَاتِهِ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*14🌇 - (( اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بصري لاَ إِلَـه إلاَّ أَنْتَ, اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لاَ إِلَـهَ إلاَّ أَنْتَ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*15🌇 - (( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ, اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي, وَدُنْيَايَ, وَأَهْلِي, وَمَالِي, اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِن رَّوْعَاتِي, اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ, وَمِن ْ خَلْفِي, وَعَنْ يَمِينِي, وَعَنْ شِمَالِي, وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*16🌇 - (( يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*17🌇 - (( أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ , اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَه اللَّيْلَة فَتَحَهَا ، وَنَصْرَهَا ، وَنُورَهَا ، وَبَرَكَتَهَا ، وَهُدَاهَا , وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا ، وَشَرِّ مَا بَعْدَهَا ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*18🌇 - (( اللَّهُمّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ, فَاطِرَ السَّمَوَاتِ وَالأَرْضِ, رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أشهد أن لا إله إلا أنت, أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشَِرَْكِهِ, وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*19🌇 - (( أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*20🌇 - (( اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*21🌇 - (( اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*22🌇 - (( أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*23🌇 - (( يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَُ )) ❸ مرات*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*24🌇 - (( لاَ إِلَـهَ إِلاَّ اَللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ, لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ )) ❿ مرات* 

*كانت له عدل عشر رقاب وكُتبت له مائة حسنة ومُحيت عنه مائة سيئة وكانت له حرزًا من الشيطان ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*25🌇 - (( اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ ))*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*26🌇 - (( الَّلهُمَّ صلِّ وَسَلِم وَبَـارِك عَلَى نَبِيِّنا مُحَمّـدْ )) ❿ مرات*

*من صلى علي حين يُصبح وحين يُمسي أدركته شفاعتي يوم القيامة ..*

*•┈┈┈••●◆❁✿❁◆●••┈┈┈•*

*27🌇 - (( سُبْحَانَ اللهِ وَبِحَمْدِهِ )) مائة مرة*

*من قالها حُطَّت خطاياه وإن كانت مثل زبد البحر ..*

          🌇🌇🌇🌇🌇🌇🌇🌇`])} 
 `.trim() 
 conn.reply(m.chat, teks, m, { mentions: { mentionedJid: [m.sender] }}) 
 }
 handler.help = ['اذكار المساء']
 handler.tags = ['islam']
 handler.customPrefix = /اذكار المساء|أذكار المساء/i 
 handler.command = new RegExp 
  
 export default handler 
  
 function pickRandom(list) { 
     return list[Math.floor(Math.random() * list.length)] 
 }
